#include "collect_xlsx.h"

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Точка входа
// Оказалось, что xlnt распознает в excel всего 3 типа - empty, shared string и number, поэтому в плане date_type она
// бесполезна!
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

int main() {
    CollectXLSX cl;
    cl.input_dir = "./";
    cl.output_name = "1.xlsx";
    cl.range_1ref = "A1:A11";
    cl.range_ref = "B2:B10";
    cl.sheet_index = 0;
    cl.collect();
}